#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.aws_sns_topic_policy.test: Refreshing state... [id=arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events]
module.demo.aws_backup_plan.plan: Refreshing state... [id=ccbb2b8d-de01-4e37-8661-2b73d8975f49]
module.demo.aws_backup_selection.selection: Refreshing state... [id=ebbf0967-c653-4ed3-a27d-58720e75a674]
module.demo.aws_iam_role.role: Refreshing state... [id=cq_backup_role]
module.demo.aws_backup_vault.backup_vault: Refreshing state... [id=cq_backup_vault]
module.demo.aws_backup_vault_notifications.test: Refreshing state... [id=cq_backup_vault]
module.demo.aws_sns_topic.backup_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events]
module.demo.aws_kms_key.backup_kms_key: Refreshing state... [id=af4ebad9-f150-4828-87b8-cc4ca26d9f81]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.demo.aws_sns_topic.backup_sns_topic has changed
  ~ resource "aws_sns_topic" "backup_sns_topic" {
        id                                       = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events"
        name                                     = "cq-backup-vault-events"
      ~ policy                                   = jsonencode(
          ~ {
              ~ Id        = "__default_policy_ID" -> "cq-backup-policy-document"
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ] -> "SNS:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "707066037989"
                            }
                        } -> null
                      ~ Principal = {
                          - AWS     = "*" -> null
                          + Service = "backup.amazonaws.com"
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
              ~ Version   = "2008-10-17" -> "2012-10-17"
            }
        )
      + tags                                     = {}
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.demo.aws_backup_plan.plan will be destroyed
  # (because aws_backup_plan.plan is not in configuration)
  - resource "aws_backup_plan" "plan" {
      - arn      = "arn:aws:backup:us-east-1:707066037989:backup-plan:ccbb2b8d-de01-4e37-8661-2b73d8975f49" -> null
      - id       = "ccbb2b8d-de01-4e37-8661-2b73d8975f49" -> null
      - name     = "cq_backup_plan" -> null
      - tags     = {
          - "key" = "backup_plan"
        } -> null
      - tags_all = {
          - "key" = "backup_plan"
        } -> null
      - version  = "YzQ2MTc4MTMtMjUwYS00Mjg5LThjNGUtZWYwMjEzZjMxNzcx" -> null

      - rule {
          - completion_window        = 180 -> null
          - enable_continuous_backup = false -> null
          - recovery_point_tags      = {} -> null
          - rule_name                = "cq_backup_rule" -> null
          - schedule                 = "cron(0 12 * * ? *)" -> null
          - start_window             = 60 -> null
          - target_vault_name        = "cq_backup_vault" -> null
        }
    }

  # module.demo.aws_backup_selection.selection will be destroyed
  # (because aws_backup_selection.selection is not in configuration)
  - resource "aws_backup_selection" "selection" {
      - iam_role_arn  = "arn:aws:iam::707066037989:role/cq_backup_role" -> null
      - id            = "ebbf0967-c653-4ed3-a27d-58720e75a674" -> null
      - name          = "cq_backup_selection" -> null
      - not_resources = [] -> null
      - plan_id       = "ccbb2b8d-de01-4e37-8661-2b73d8975f49" -> null
      - resources     = [] -> null

      - condition {
        }

      - selection_tag {
          - key   = "foo" -> null
          - type  = "STRINGEQUALS" -> null
          - value = "bar" -> null
        }
    }

  # module.demo.aws_backup_vault.backup_vault will be destroyed
  # (because aws_backup_vault.backup_vault is not in configuration)
  - resource "aws_backup_vault" "backup_vault" {
      - arn             = "arn:aws:backup:us-east-1:707066037989:backup-vault:cq_backup_vault" -> null
      - id              = "cq_backup_vault" -> null
      - kms_key_arn     = "arn:aws:kms:us-east-1:707066037989:key/af4ebad9-f150-4828-87b8-cc4ca26d9f81" -> null
      - name            = "cq_backup_vault" -> null
      - recovery_points = 0 -> null
      - tags            = {
          - "key" = "backup_vault"
        } -> null
      - tags_all        = {
          - "key" = "backup_vault"
        } -> null
    }

  # module.demo.aws_backup_vault_notifications.test will be destroyed
  # (because aws_backup_vault_notifications.test is not in configuration)
  - resource "aws_backup_vault_notifications" "test" {
      - backup_vault_arn    = "arn:aws:backup:us-east-1:707066037989:backup-vault:cq_backup_vault" -> null
      - backup_vault_events = [
          - "BACKUP_JOB_STARTED",
          - "RESTORE_JOB_COMPLETED",
        ] -> null
      - backup_vault_name   = "cq_backup_vault" -> null
      - id                  = "cq_backup_vault" -> null
      - sns_topic_arn       = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events" -> null
    }

  # module.demo.aws_iam_role.role will be destroyed
  # (because aws_iam_role.role is not in configuration)
  - resource "aws_iam_role" "role" {
      - arn                   = "arn:aws:iam::707066037989:role/cq_backup_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "backup.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-04-04T12:39:55Z" -> null
      - force_detach_policies = false -> null
      - id                    = "cq_backup_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSBackupFullAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "cq_backup_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA2JIDLQ3SX6JXI2PHM" -> null

      - inline_policy {}
    }

  # module.demo.aws_kms_key.backup_kms_key will be destroyed
  # (because aws_kms_key.backup_kms_key is not in configuration)
  - resource "aws_kms_key" "backup_kms_key" {
      - arn                                = "arn:aws:kms:us-east-1:707066037989:key/af4ebad9-f150-4828-87b8-cc4ca26d9f81" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - enable_key_rotation                = false -> null
      - id                                 = "af4ebad9-f150-4828-87b8-cc4ca26d9f81" -> null
      - is_enabled                         = true -> null
      - key_id                             = "af4ebad9-f150-4828-87b8-cc4ca26d9f81" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::707066037989:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
    }

  # module.demo.aws_sns_topic.backup_sns_topic will be destroyed
  # (because aws_sns_topic.backup_sns_topic is not in configuration)
  - resource "aws_sns_topic" "backup_sns_topic" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "cq-backup-vault-events" -> null
      - owner                                    = "707066037989" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "cq-backup-policy-document"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "backup.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # module.demo.aws_sns_topic_policy.test will be destroyed
  # (because aws_sns_topic_policy.test is not in configuration)
  - resource "aws_sns_topic_policy" "test" {
      - arn    = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events" -> null
      - id     = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events" -> null
      - owner  = "707066037989" -> null
      - policy = jsonencode(
            {
              - Id        = "cq-backup-policy-document"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "backup.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:707066037989:cq-backup-vault-events"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.demo.aws_wafv2_ip_set.ipset1 will be created
  + resource "aws_wafv2_ip_set" "ipset1" {
      + addresses          = [
          + "1.2.3.4/32",
          + "5.6.7.8/32",
        ]
      + arn                = (known after apply)
      + description        = "Example IP set"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "cq-ipset"
      + scope              = "REGIONAL"
      + tags               = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all           = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
    }

  # module.demo.aws_wafv2_ip_set.ipset2 will be created
  + resource "aws_wafv2_ip_set" "ipset2" {
      + addresses          = [
          + "1.2.3.4/32",
          + "5.6.7.8/32",
        ]
      + arn                = (known after apply)
      + description        = "Example IP set"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "cq-ipset"
      + scope              = "CLOUDFRONT"
      + tags               = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all           = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
    }

  # module.demo.aws_wafv2_regex_pattern_set.regex1 will be created
  + resource "aws_wafv2_regex_pattern_set" "regex1" {
      + arn         = (known after apply)
      + description = "Example regex pattern set 1"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "cq-regex-set1"
      + scope       = "REGIONAL"
      + tags        = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all    = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }

      + regular_expression {
          + regex_string = "one"
        }
      + regular_expression {
          + regex_string = "two"
        }
    }

  # module.demo.aws_wafv2_regex_pattern_set.regex2 will be created
  + resource "aws_wafv2_regex_pattern_set" "regex2" {
      + arn         = (known after apply)
      + description = "Example regex pattern set 2"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "cq-regex-set2"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all    = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }

      + regular_expression {
          + regex_string = "one"
        }
      + regular_expression {
          + regex_string = "two"
        }
    }

Plan: 4 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*